# Accessing And Changing Values of  DataFrames

For this purpose we will learn to know the methods loc ,at and replace

In [3]:
import pandas as pd
first = ('Mike', 'Naf', 'Tom', 'Bill', 'Peter', 'Kate')
last = ('Meyer', 'Maier', 'Meyer', 'Mayer', 'Meyr', 'Mair')
job = ('data analyst', 'programmer', 'computer scientist','data scientist', 'accountant', 'psychiatrist')
language = ('Python', 'Perl', 'Java', 'Java', 'Cobol', 'Ruby')
df = pd.DataFrame(list(zip(last, job, language)),
columns =['last', 'job', 'language'],index=first)
df

        last                 job language
Mike   Meyer        data analyst   Python
Naf    Maier          programmer     Perl
Tom    Meyer  computer scientist     Java
Bill   Mayer      data scientist     Java
Peter   Meyr          accountant    Cobol
Kate    Mair        psychiatrist     Ruby

#### CHANGING ONE VALUE IN DATAFRAME

Pandas provides two ways, i.e. loc and at , to access or change a single value of a DataFrame

In [4]:
# accessing the job of Bill:
print(df.loc['Bill', 'job'])
# setting the job of Bill to 'data analyst' with 'loc'
df.loc['Bill', 'job'] = 'data analyst'
df

data scientist

        last                 job language
Mike   Meyer        data analyst   Python
Naf    Maier          programmer     Perl
Tom    Meyer  computer scientist     Java
Bill   Mayer        data analyst     Java
Peter   Meyr          accountant    Cobol
Kate    Mair        psychiatrist     Ruby

In [5]:
#use replace to change values of the dataframe
df.replace("programmer","computer scientist",inplace=True)
df

        last                 job language
Mike   Meyer        data analyst   Python
Naf    Maier  computer scientist     Perl
Tom    Meyer  computer scientist     Java
Bill   Mayer        data analyst     Java
Peter   Meyr          accountant    Cobol
Kate    Mair        psychiatrist     Ruby

#### THE METHOD PARAMETER OF REPLACE:

When the parameter value is None and the parameter to_replace is a scalar, list or tuple, the method replace will use the parameter method to decide which replacement to perform. The possible values for method are pad , ffill , bfill , None . The default value is pad .

First of all, you have to know that pad and ffill are equivalent.

We will explain the way of working with the following Python example code. We will replace the value PSYCHIATRIST  of the following DataFrame in different ways by using the parameter method .

In [10]:
df.replace(to_replace='computer scientist', value=None, method='ffill')

        last           job language
Mike   Meyer  data analyst   Python
Naf    Maier  data analyst     Perl
Tom    Meyer  data analyst     Java
Bill   Mayer  data analyst     Java
Peter   Meyr    accountant    Cobol
Kate    Mair  psychiatrist     Ruby

In [12]:
df.replace(to_replace='psychiatrist', value=None, method='ffill', inplace=True)
df

        last                 job language
Mike   Meyer        data analyst   Python
Naf    Maier  computer scientist     Perl
Tom    Meyer  computer scientist     Java
Bill   Mayer        data analyst     Java
Peter   Meyr          accountant    Cobol
Kate    Mair          accountant     Ruby

# GroupBY

The
Pandas groupby operation involves some combination
of splitting the object, applying a function, and combining
the results. We can split a DataFrame object into groups
based on various criteria and row and column-wise, i.e.
using axis .
'Applying' means
• to filter the data,
• transform the data or
• aggregate the data.
groupby can be applied to Pandas Series objects and
DataFrame objects!

In [17]:
import pandas as pd
import numpy as np
import random

nvalues = 30
values = np.random.randint(1,20, (nvalues))
fruits = ["bananas", "oranges", "apples", "clementines", "cherries", "pears"]
fruits_index = np.random.choice(fruits, (nvalues,))
s = pd.Series(values, index=fruits_index)
print(s[:10])

cherries        8
oranges        15
apples         16
cherries       12
bananas         1
cherries       13
oranges         1
bananas         3
oranges         4
clementines     3
dtype: int32

In [18]:
grouped = s.groupby(s.index)
grouped

In [24]:
grouped = s.groupby(s.index)
for fruit, s_obj in grouped:
    print(f"<<< {fruit}>>>")
    print(s_obj)

<<< apples>>>
apples    16
apples     9
dtype: int32
<<< bananas>>>
bananas     1
bananas     3
bananas     2
bananas     1
bananas    14
dtype: int32
<<< cherries>>>
cherries     8
cherries    12
cherries    13
cherries     5
cherries    13
cherries    12
dtype: int32
<<< clementines>>>
clementines     3
clementines    17
clementines     1
clementines     9
clementines     9
clementines     4
clementines    10
dtype: int32
<<< oranges>>>
oranges    15
oranges     1
oranges     4
oranges    11
oranges     6
dtype: int32
<<< pears>>>
pears     4
pears    12
pears     1
pears     1
pears    13
dtype: int32

###  GROUPBY WITH DATAFRAMES

. The DataFRame has two columns one containing names Name and the other one Coffee contains integers which are the number of cups of coffee the person drank.

In [33]:
import pandas as pd
Beverages = pd.DataFrame({'Name': ['Robert', 'Melinda', 'Brenda','Samantha', 
                                   'Melinda', 'Robert','Melinda', 'Brenda', 'Samantha'],
                                'Coffee': [3, 0, 2, 2, 0, 2, 0, 1, 3],
                          'Tea': [0, 4, 2, 0, 3, 0, 3, 2, 0]})

Beverages

       Name  Coffee  Tea
0    Robert       3    0
1   Melinda       0    4
2    Brenda       2    2
3  Samantha       2    0
4   Melinda       0    3
5    Robert       2    0
6   Melinda       0    3
7    Brenda       1    2
8  Samantha       3    0

We can see that some of the names appear multiple times. So it will be very interesting to see how many cups of coffee and tea each person drank in total. That means we are applying 'groupby' to the 'Name' column. Thereby we split the DatFrame. Then we apply 'sum' to the results of 'groupby':

In [35]:
results=Beverages.groupby(["Name"]).sum()
results

          Coffee  Tea
Name
Brenda         3    4
Melinda        0   10
Robert         5    0
Samantha       5    0

##### QUESTIONS

In [36]:
import pandas as pd
d = {"products": ["Oppilume", "Dreaker", "Lotadilo",
"Crosteron", "Wazzasoft", "Oppilume",
"Dreaker", "Lotadilo", "Wazzasoft"],
"colours": ["blue", "blue", "blue",
"green", "blue", "green",
"green", "green", "red"],
"customer_price": [2345.89, 2390.50, 1820.00, 3100.00, 1784.50, 2545.89, 2590.50, 2220.00, 2084.50],
"non_customer_price": [2445.89, 2495.50, 1980.00, 3400.00, 1921.00, 2645.89, 2655.50, 2140.00, 2190.00]}
product_prices = pd.DataFrame(d)
product_prices

    products colours  customer_price  non_customer_price
0   Oppilume    blue         2345.89             2445.89
1    Dreaker    blue         2390.50             2495.50
2   Lotadilo    blue         1820.00             1980.00
3  Crosteron   green         3100.00             3400.00
4  Wazzasoft    blue         1784.50             1921.00
5   Oppilume   green         2545.89             2645.89
6    Dreaker   green         2590.50             2655.50
7   Lotadilo   green         2220.00             2140.00
8  Wazzasoft     red         2084.50             2190.00

### TAST 1 
Calculate the average prices of the products of the ABOVE DataFrame:

In [39]:
avrg = product_prices.groupby(['products']).mean()
avrg

C:\Users\DELL\AppData\Local\Temp\ipykernel_13304\1736219729.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  avrg = product_prices.groupby(['products']).mean()

           customer_price  non_customer_price
products
Crosteron         3100.00             3400.00
Dreaker           2490.50             2575.50
Lotadilo          2020.00             2060.00
Oppilume          2445.89             2545.89
Wazzasoft         1934.50             2055.50

### TAST 2
Calculate the sum of the price according to the colours.

In [41]:
Y = product_prices.groupby(['colours']).sum()
Y

C:\Users\DELL\AppData\Local\Temp\ipykernel_13304\1707591673.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  Y = product_prices.groupby(['colours']).sum()

         customer_price  non_customer_price
colours
blue            8340.89             8842.39
green          10456.39            10841.39
red             2084.50             2190.00

#### TASK 3